{
  "header": {
    "home": "INICIO",
    "aboutMe": "SOBRE MÍ",
    "contact": "CONTACTO"
  },

  "headerLink" :{
    "home" : "inicio",
    "aboutMe" : "sobre-mi",
    "contact" : "contacto"
  },

 

  "footer": {
    "text": "Creando experiencias sorprendentes y soluciones innovadoras para nuestros clientes en todo el mundo.",
    "copy": "Todos los derechos reservados",
    "home": "Inicio",
    "aboutMe": "Sobre mí",
    "contact": "Contacto"
  },

  "home": {
    "title": "Bienvenido a mi portafolio",
    "presentation1": "Soy Genís, técnico en sistemas informáticos y desarrollador web junior. Me gusta la informática en todos sus aspectos, tanto la parte de programación como la administración de sistemas y hardware.",
    "presentation2": "En esta página encontrarás un poco de mi recorrido, mis conocimientos y algunos proyectos que he realizado. Si buscas a alguien responsable, con ganas de aprender y crecer profesionalmente, estás en el lugar adecuado.",
    "downloadCv": "Descargar mi CV",

    "titleWorks": "Experiencia laboral",
    "titleYepes": "Paletizador en Viyefruit/sa",
    "descriptionYepes": "Configuración y supervisión de la máquina paletizadora, control del proceso de carga y aseguramiento del palet para el transporte.",
    "titleTorres": "Programador en TorresEnergia - Contrato de prácticas",
    "descriptionTorres": "Actualización de la página web, automatizaciones con Visual Basic en Excel y mapeo de la red interna.",
    "titleCapa": "Técnico informático en Institut Caparrell - Contrato de prácticas",
    "descriptionCapa": "Mantenimiento y reparación de equipos, instalación y configuración de sistemas operativos, gestión de software y copias de seguridad.",
    "titleOptica": "Técnico informático en Natural Optics Group - Contrato de prácticas",
    "descriptionOptica": "Mantenimiento de equipos, instalación de sistemas operativos y software, asegurando el correcto funcionamiento de los dispositivos.",

    "projects": "Proyectos",
    "titlePortfolio" : "Portafolio personal",
    "descriptionPortfolio" : "Este portafolio está desarrollado con React y es completamente responsive, adaptándose a cualquier dispositivo. Está preparado para multiidioma e integra EmailJS, de modo que cualquier contacto realizado a través del formulario envía automáticamente un correo electrónico con los datos del visitante. El formulario de contacto incluye validaciones en tiempo real, mensajes de error y un contador de caracteres, ofreciendo una experiencia de usuario clara y funcional. El código del portafolio está disponible en GitHub.",
    "titleAlpicat": "Club Futbol Alpicat (Proyecto real)",
    "descriptionAlpicat": "Aplicación web desarrollada con PHP y el framework CodeIgniter 4, con una base de datos MySQL. El proyecto permite a los usuarios de cualquier edad acceder fácilmente a toda la información del club de fútbol: consultar los últimos resultados, ver la clasificación de cada categoría, leer novedades y noticias recientes y acceder a una zona privada para administradores. Esta área de administración permite gestionar el contenido del sitio web de manera sencilla y segura. El diseño está pensado para ser intuitivo y accesible, con una estructura clara y funcional. El proyecto incluye documentación técnica detallada y el código fuente está disponible para consulta.",
    "code": "Código fuente",
    "docu": "Documentación técnica del proyecto",

    "titleJava": "Gestor de tickets de compra en Java",
    "descriptionJava": "Aplicación de consola en Java con Maven que permite gestionar un ticket de compra. El usuario puede agregar productos, consultar el ticket completo, visualizar el precio total y acceder a cada línea de pedido mediante su índice. El proyecto incluye constructores, métodos (getters, setters, equals, hashCode, toString) y control de límites en el array para evitar agregar más de 10 líneas.",

    "titleDawguardia": "DAWGuarida — Gestor de Noticias",
    "descriptionDawguardia": "DawGuardia es una aplicación web desarrollada con CodeIgniter 4 que simula el funcionamiento de un periódico digital de última generación. La aplicación implementa una parte pública y privada con un sistema de roles completo de Administrador, Editor, Periodista, Suscriptor y Visitante, cada uno con permisos específicos. El proyecto aplica el patrón MVC con CodeIgniter y la gestión de base de datos con MySQL. Las funcionalidades principales son:",
    "functionDawguardia1": "Gestión de noticias por parte de periodistas, con validación previa de los editores.",
    "functionDawguardia2": "Clasificación por secciones (local, deportes, sociedad, opinión, etc.).",
    "functionDawguardia3": "Sistema de comentarios: los visitantes pueden comentar, pero los comentarios deben ser validados; los suscriptores pueden hacerlo libremente.",
    "functionDawguardia4": "Noticias exclusivas para suscriptores.",
    "functionDawguardia5": "Gestión de suscripciones: alta, validación y desactivación de usuarios por impago.",
    "functionDawguardia6": "Panel administrativo completo para controlar usuarios, roles, secciones y publicaciones.",
    "functionDawguardia7": "Compartición de noticias mediante enlaces públicos del tipo: https://localhost/noticia/seccion/el-titular-de-la-noticia."
  },

  "aboutMe": {
    "title": "Sobre mí",
    "presentation1": "¡Hola! Soy Genís Bou, técnico en Administración de Sistemas Informáticos en Red (ASIR) y graduado en Desarrollo de Aplicaciones Web (DAW). Me interesan tanto los sistemas —gestión de equipos, redes e infraestructura— como la programación, tanto backend como frontend.",
    "presentation2": "Me considero una persona constante, responsable y con facilidad para aprender. Disfruto trabajando en equipo y me gusta mantener una actitud proactiva, mejorando procesos y buscando nuevas soluciones.",
    "presentation3": "Actualmente continúo ampliando mis conocimientos en desarrollo web, aprendiendo frameworks modernos y reforzando conceptos de backend, frontend y bases de datos, con el objetivo de crecer en este mundo web.",

    "titleTraining": "Formación Académica",
    "titleDaw": "Grado Superior en Desarrollo de Aplicaciones Web – DAW",
    "titleAsix": "Grado Superior en Administración de Sistemas Informáticos en Red – ASIR",
    "titleSmx": "Grado Medio en Sistemas Microinformáticos y Redes – SMR",

    "skills": "Habilidades técnicas",
    "networking": "Redes, Montaje",
    "objectives": "Objetivos",
    "objectivesText": "Mi objetivo es crecer como desarrollador web y seguir formándome en tecnologías modernas, aportando a la vez una visión técnica basada en mi experiencia en sistemas, automatización y mantenimiento informático."
  },

  "contact": {
    "title": "Contacta conmigo",
    "description": "Si tienes alguna duda, propuesta u oportunidad laboral, estaré encantado de hablarlo. Puedes escribirme directamente o utilizar el formulario.",
    "details": "Datos de contacto",
    "viewProfile": "Ver Perfil",
    "contact": "Contacto",
    "name": "Nombre",
    "email": "Correo electrónico",
    "phone": "Teléfono",
    "messagePh": "Escribe tu mensaje aquí. Te responderé lo antes posible.",
    "message" : "Mensaje",
    "submit": "Enviar",
    "messageSubmit": "¡Mensaje enviado con éxito!",
    "errorName" : "El nombre no es válido.",
    "errorEmail" : "El correo no es válido.",
    "errorTel" : "El teléfono no es válido.",
    "errorGeneral": "Por favor, rellene el formulario correctamente.",
    "errorMessage": "El mensaje debe tener al menos 10 caracteres y como máximo 500 caracteres."

  }


}
